In [6]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [7]:
pd.DataFrame({"a":[1,2], "b":[3,4], "c":[5,6]}, index=[1,2])

   a  b  c
1  1  3  5
2  2  4  6

In [3]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], index=range(1,5), columns=["A","B","C"])

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [5]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [26]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  57  90  55
1  24  12  66

In [9]:
''.join(random.choice(string.ascii_letters) for i in range(5))

'XVYyS'

In [30]:
pd.DataFrame({random.choice(string.ascii_letters) for i in range(5)})

   0
0  i
1  t
2  G
3  Y
4  h

In [13]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range (5))

In [14]:
id()

'FpRWT'

In [15]:
def score():
    return np.random.randint(0, 100)

In [16]:
score()

22

In [66]:
pd.DataFrame(score(), index=[id()]*10, columns=["국어","영어","수학","사회"])

       국어  영어  수학  사회
egqVN  15  15  15  15
egqVN  15  15  15  15
egqVN  15  15  15  15
egqVN  15  15  15  15
egqVN  15  15  15  15
egqVN  15  15  15  15
egqVN  15  15  15  15
egqVN  15  15  15  15
egqVN  15  15  15  15
egqVN  15  15  15  15